
#Домашнее задание: коллекции и объекты

#Задание 1. Палиндром (строки + slicing)
"""Напишите программу, которая проверяет, является ли строка палиндромом. Палиндром — это строка, которая читается одинаково слева направо и справа налево.

Требования:
Задайте строку в переменной text: str, например "А роза упала на лапу Азора".
Приведите строку к нижнему регистру и уберите все пробелы (используйте .lower() и .replace(" ", "")).
С помощью slicing ([::-1]) получите перевёрнутую строку.
Сравните исходную и перевёрнутую строки и выведите "Палиндром" или "Не палиндром". """

text = input("Введите слово или предложение для проверки на палиндром: ").lower().replace(" ", "")
inverted_text = text[::-1]
if inverted_text == text: 
    print("Палиндром")
else:
    print("Не палиндром") 


#Задание 2. Сумма границ (список + slicing)

""" Дан список чисел:
numbers = [10, 20, 30, 40, 50, 60]

С помощью slicing и распаковки получите первый и последний элементы списка в отдельные переменные first и last.

Подсказка: first, *middle, last = numbers — это iterable unpack.
Посчитайте сумму границ: first + last.
Посчитайте сумму всех элементов среза numbers[1:-1] (без первого и последнего) через sum(...).
Выведите на экран каждое значение с новой строки в таком порядке:
первый элемент,
последний элемент,
сумма границ,
сумма середины. """

numbers = [10, 20, 30, 40, 50, 60]
first, *middle, last = numbers
print(first)
print(last)
print(last+first)
print(sum(middle)) #или print sum(numbers[1:-1])


#Задание 3. Mutable и Immutable, копирование

""" Даны две переменные:

original = [1, 2, 3]
alias = original
copy_list = original[:]

Измените первый элемент alias: alias[0] = 100.
Выведите original и alias. Объясните в комментарии почему изменения в alias отразились (или не отразились) на original.
Добавьте в copy_list новый элемент через .append(4).
Выведите original и copy_list. Объясните в комментарии, почему original не изменился после этого.
Создайте кортеж t = (1, 2, 3). Попробуйте изменить его первый элемент: t[0] = 100.
Закомментируйте эту строку ( t[0] = 100), а рядом в комментарии напишите, какая ошибка возникла бы и почему (кортеж — immutable). """

original = [1, 2, 3]
alias = original
copy_list = original[:]

alias[0] = 100
print(original, " ", alias) #отразились тк находятся в одной области памяти и являются изменяемыми
copy_list.append(10) #Потому что мы не приравняли а содали шеллкопию,
print(copy_list, " ", original)
t = (1, 2, 3)
# t[0] = 100 Кортеж неизменяемый тип данных