""" Цель упражнения: Создать программу, которая получает ввод пользователя и проверяет, является ли введенное слово палиндромом, используя конструкции if, else и слайсы.
Шаги выполнения программы:
Запросите у пользователя ввод с помощью функции input().
Преобразуйте введенное слово в нижний регистр для корректной проверки, используя метод lower().
Инвертируйте слово, используя слайсы: inverted_word = word[::-1].
Проверьте равенство исходного и инвертированного слова:
Если они равны, слово является палиндромом — выводим "Это палиндром".
Если не равны — выводим "Это не палиндром". """

word = input("Введите слово для проверки на палиндром: ").strip().lower()
inverted_word = word[::-1]

if inverted_word == word: 
    print("Это палиндром")
else:
    print("Это не палиндром")


    