""" Цель упражнения: Создать программу, которая получает ввод пользователя и проверяет, является ли введенное слово палиндромом, используя конструкции if, else и слайсы.
Шаги выполнения программы:
Запросите у пользователя ввод с помощью функции input().
Преобразуйте введенное слово в нижний регистр для корректной проверки, используя метод lower().
Инвертируйте слово, используя слайсы: inverted_word = word[::-1].
Проверьте равенство исходного и инвертированного слова:
Если они равны, слово является палиндромом — выводим "Это палиндром".
Если не равны — выводим "Это не палиндром". """

word = input("Введите слово для проверки на палиндром: ").strip().lower()
inverted_word = word[::-1]

if inverted_word == word: 
    print("Это палиндром")
else:
    print("Это не палиндром")


    
#Задача 2:
""" Дан список чисел.
Необходимо суммировать крайние элементы (первый и последний).
Суммировать все остальные элементы в отдельный результат.
Вывести результаты в виде кортежа (сумма крайних элементов, сумма всех остальных).
Использование функции SUM:

Используйте распаковку списка для получения первых и последних элементов и всех остальных.
Пример кода:
python
first, *middle, last = [10, 1, 2, 3, 5]
result = (first + last, sum(middle))
SUM возвращает 0 при суммировании пустого списка.
Особые случаи:

Если в списке меньше двух элементов, обработка невозможна без модификаций, так как некому быть "last". """



first, *middle, last = (10, 2, 3, 5)
sum1 = first + last
sum2 = sum(middle)
print (sum1, " ", sum2)