
""" Требования:
Для дней 1–5 выведите название дня и строку "Будний день".
Для дней 6 и 7 выведите название дня и строку "Выходной день".
Если введено число вне диапазона 1–7, выведите только "Некорректный день". """

day_number = int(input("Введите номер дня от 1 до 7:  "))

match day_number:
    case 1:
        print("Понедельник -" " Будний день")
    case 2:
        print("Вторник -" " Будний день")
    case 3:
        print("Среда -" " Будний день")
    case 4:
        print("Четверг -" " Будний день")
    case 5:
        print("Пятница -" " Будний день")
    case 6:
        print("Суббота -" " Выходной день")
    case 7:
        print("Воскресенье -" " Выходной день")
    case _:
        print("Некорректный день")