a:int = 17
b = 5

""" Сумма a и b.
Разность a и b.
Произведение a и b.
Результат обычного деления a на b.
Результат целочисленного деления a на b.
Остаток от деления a на b.
a в степени b.
Проверьте, больше ли a, чем b (оператор сравнения) — выведите True или False.
Проверьте, является ли a чётным числом (используйте остаток от деления и сравнение с нулём) — выведите True или False.
Вычислите выражение a + b * 2 > 20 and a % 2 == 0 и выведите результат (обратите внимание на приоритет операторов). """

print(a + b)
print(a - b)
print(a * b)
print(a / b)
print(a // b)
print(a % b)
print(a ** b)
print(a > b)
print(a % 2 == 0)
print(a + b * 2 > 20 and a % 2 == 0)

